In [67]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [68]:
df1 = pd.read_csv(r"D:\rishabhinternship\Fitness Classes Data\Classes April-May 2018.csv")
df2 = pd.read_csv(r"D:\rishabhinternship\Fitness Classes Data\Classes June 2018.csv")

In [69]:
print(df1.shape,df2.shape)

(2177, 7) (1112, 7)

In [70]:
print(df1.head(),df2.head())

  ActivitySiteID      ActivityDescription  \
0            HXP  20-20-20  2.45pm-3.45pm
1            HXP  20-20-20  2.45pm-3.45pm
2            HXP  20-20-20  2.45pm-3.45pm
3            HXP  20-20-20  2.45pm-3.45pm
4            HXP  20-20-20  2.45pm-3.45pm

  BookingEndDateTime (Month / Day / Year) BookingStartTime  MaxBookees  \
0                               08-Apr-18         14:45:00          25
1                               15-Apr-18         14:45:00          25
2                               22-Apr-18         14:45:00          25
3                               29-Apr-18         14:45:00          25
4                               06-May-18         14:45:00          25

   Number Booked  Price (INR)
0             12        499.0
1             15        499.0
2             14        499.0
3              9        499.0
4              7        499.0     ActivitySiteID     ActivityDescription  \
0            BRP  20:20:20  9.30-10.30am
1            BRP  20:20:20  9.30-10.30am
2            BRP  20:20:20  9.30-10.30am
3            BRP  20:20:20  9.30-10.30am
4            BRP  20:20:20  9.30-10.30am

  BookingEndDateTime (Month / Day / Year) BookingStartTime  MaxBookees  \
0                               01-Jun-18          9:30:00          35
1                               08-Jun-18          9:30:00          35
2                               15-Jun-18          9:30:00          35
3                               22-Jun-18          9:30:00          35
4                               29-Jun-18          9:30:00          35

   Number Booked  Price (INR)
0             28          499
1             35          499
2             31          499
3             32          499
4             19          499

#### Combine the datasets

In [71]:
df = pd.concat([df1,df2],ignore_index = True)
df.shape

(3289, 7)

#### check columns, info and missing values

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 7 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   ActivitySiteID                           3289 non-null   object
 1   ActivityDescription                      3289 non-null   object
 2   BookingEndDateTime (Month / Day / Year)  3289 non-null   object
 3   BookingStartTime                         3289 non-null   object
 4   MaxBookees                               3289 non-null   int64
 5   Number Booked                            3289 non-null   int64
 6   Price (INR)                              3271 non-null   float64
dtypes: float64(1), int64(2), object(4)
memory usage: 180.0+ KB

In [73]:
df.isnull().sum()

ActivitySiteID                              0
ActivityDescription                         0
BookingEndDateTime (Month / Day / Year)     0
BookingStartTime                            0
MaxBookees                                  0
Number Booked                               0
Price (INR)                                18
dtype: int64

In [74]:
# impute the missing value
df["Price (INR)"] = df["Price (INR)"].fillna(df["Price (INR)"].median())

In [75]:
df.isnull().sum()

ActivitySiteID                             0
ActivityDescription                        0
BookingEndDateTime (Month / Day / Year)    0
BookingStartTime                           0
MaxBookees                                 0
Number Booked                              0
Price (INR)                                0
dtype: int64

In [76]:
df.describe(include="all")

,ActivitySiteID,ActivityDescription,BookingEndDateTime (Month / Day / Year),BookingStartTime,MaxBookees,Number Booked,Price (INR)
count,3289,3289,3289,3289,3289.000000,3289.000000,3289.000000
unique,5,280,91,61,NaN,NaN,NaN
top,HXP,Body Conditioning 10-11am,20-Jun-18,10:00:00,NaN,NaN,NaN
freq,771,39,54,312,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,32.179386,17.088781,1850.778656
std,NaN,NaN,NaN,NaN,15.092156,9.504098,790.894827
min,NaN,NaN,NaN,NaN,2.000000,1.000000,499.000000
25%,NaN,NaN,NaN,NaN,24.000000,10.000000,1299.000000
50%,NaN,NaN,NaN,NaN,30.000000,16.000000,1499.000000
75%,NaN,NaN,NaN,NaN,35.000000,24.000000,2499.000000
max,NaN,NaN,NaN,NaN,70.000000,64.000000,3999.000000

#### Handle the missing values

In [77]:
df["Price (INR)"].describe()

count    3289.000000
mean     1850.778656
std       790.894827
min       499.000000
25%      1299.000000
50%      1499.000000
75%      2499.000000
max      3999.000000
Name: Price (INR), dtype: float64

In [78]:
df["Price (INR)"].value_counts()

Price (INR)
1999.0    748
2999.0    594
1499.0    573
999.0     550
1299.0    436
2499.0    181
499.0     105
3999.0     78
799.0      24
Name: count, dtype: int64

In [79]:
df.isnull().sum()

ActivitySiteID                             0
ActivityDescription                        0
BookingEndDateTime (Month / Day / Year)    0
BookingStartTime                           0
MaxBookees                                 0
Number Booked                              0
Price (INR)                                0
dtype: int64

#### Remove Duplicates

In [80]:
df.duplicated().sum()

0

#### correct Data types

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 7 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   ActivitySiteID                           3289 non-null   object
 1   ActivityDescription                      3289 non-null   object
 2   BookingEndDateTime (Month / Day / Year)  3289 non-null   object
 3   BookingStartTime                         3289 non-null   object
 4   MaxBookees                               3289 non-null   int64
 5   Number Booked                            3289 non-null   int64
 6   Price (INR)                              3289 non-null   float64
dtypes: float64(1), int64(2), object(4)
memory usage: 180.0+ KB

In [82]:
df["BookingEndDateTime"] = pd.to_datetime(df["BookingEndDateTime (Month / Day / Year)"], format = "%d-%b-%y")

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 8 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   ActivitySiteID                           3289 non-null   object
 1   ActivityDescription                      3289 non-null   object
 2   BookingEndDateTime (Month / Day / Year)  3289 non-null   object
 3   BookingStartTime                         3289 non-null   object
 4   MaxBookees                               3289 non-null   int64
 5   Number Booked                            3289 non-null   int64
 6   Price (INR)                              3289 non-null   float64
 7   BookingEndDateTime                       3289 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 205.7+ KB

####  rename the columns

In [84]:
df.rename(columns = {"BookingEndDateTime (Month / Day / Year)": "BookingEndDate"},inplace=True)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ActivitySiteID       3289 non-null   object
 1   ActivityDescription  3289 non-null   object
 2   BookingEndDate       3289 non-null   object
 3   BookingStartTime     3289 non-null   object
 4   MaxBookees           3289 non-null   int64
 5   Number Booked        3289 non-null   int64
 6   Price (INR)          3289 non-null   float64
 7   BookingEndDateTime   3289 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 205.7+ KB

#### Convert Time to datetime or hour

In [86]:
df["BookingStartTime"] = pd.to_datetime(df["BookingStartTime"]).dt.time

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ActivitySiteID       3289 non-null   object
 1   ActivityDescription  3289 non-null   object
 2   BookingEndDate       3289 non-null   object
 3   BookingStartTime     3289 non-null   object
 4   MaxBookees           3289 non-null   int64
 5   Number Booked        3289 non-null   int64
 6   Price (INR)          3289 non-null   float64
 7   BookingEndDateTime   3289 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 205.7+ KB

In [89]:
df["BookingDateTime"] = pd.to_datetime(df["BookingEndDate"] + " " + df["BookingStartTime"].astype(str))

In [96]:
df["BookingEndDate"] = pd.to_datetime(df["BookingEndDate"])

In [103]:
df.columns

Index(['ActivitySiteID', 'ActivityDescription', 'BookingEndDate',
       'BookingStartTime', 'MaxBookees', 'Number Booked', 'Price (INR)',
       'BookingEndDateTime', 'BookingDateTime'],
      dtype='object')

In [105]:
df["Year"] = df["BookingEndDateTime"].dt.year
df["Month"] = df["BookingEndDateTime"].dt.month
df["Day"] = df["BookingEndDateTime"].dt.day
df["Weekday"] = df["BookingEndDateTime"].dt.day_name()
df["Week"] = df["BookingEndDateTime"].dt.isocalendar().week
df["Hour"] = df["BookingDateTime"].dt.hour

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3289 entries, 0 to 3288
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ActivitySiteID       3289 non-null   object
 1   ActivityDescription  3289 non-null   object
 2   BookingEndDate       3289 non-null   datetime64[ns]
 3   BookingStartTime     3289 non-null   object
 4   MaxBookees           3289 non-null   int64
 5   Number Booked        3289 non-null   int64
 6   Price (INR)          3289 non-null   float64
 7   BookingEndDateTime   3289 non-null   datetime64[ns]
 8   BookingDateTime      3289 non-null   datetime64[ns]
 9   Year                 3289 non-null   int32
 10  Month                3289 non-null   int32
 11  Day                  3289 non-null   int32
 12  Weekday              3289 non-null   object
 13  Week                 3289 non-null   UInt32
 14  Hour                 3289 non-null   int32
dtypes: UInt32(1), datetime64[ns](3), float64(1), int32(4), int64(2), object(4)
memory usage: 324.5+ KB

### Normalize

In [110]:
from sklearn.preprocessing import StandardScaler

In [112]:
scaler = StandardScaler()

numerical_cols = ["MaxBookees","Number Booked","Price (INR)"]

df_scaled = scaler.fit_transform(df[numerical_cols])

#### Add Scaled Columns Back Into the Dataset

In [113]:
df[["MaxBookees_scaled","Number Booked_scaled","Price_scaled"]] = df_scaled

In [114]:
df[["MaxBookees_scaled","Number Booked_scaled","Price_scaled"]].head()

   MaxBookees_scaled  Number Booked_scaled  Price_scaled
0          -0.475775             -0.535512     -1.709436
1          -0.475775             -0.219810     -1.709436
2          -0.475775             -0.325044     -1.709436
3          -0.475775             -0.851213     -1.709436
4          -0.475775             -1.061680     -1.709436

In [116]:
df.describe()

,BookingEndDate,MaxBookees,Number Booked,Price (INR),BookingEndDateTime,BookingDateTime,Year,Month,Day,Week,Hour,MaxBookees_scaled,Number Booked_scaled,Price_scaled
count,3289,3289.000000,3289.000000,3289.000000,3289,3289,3289.0,3289.000000,3289.000000,3289.0,3289.000000,3.289000e+03,3.289000e+03,3.289000e+03
mean,2018-05-16 08:58:57.610215680,32.179386,17.088781,1850.778656,2018-05-16 08:58:57.610215680,2018-05-16 22:37:27.035572992,2018.0,5.010946,15.707814,19.995135,13.392825,1.901118e-16,-1.123388e-16,-8.641444e-17
min,2018-04-01 00:00:00,2.000000,1.000000,499.000000,2018-04-01 00:00:00,2018-04-01 09:00:00,2018.0,4.000000,1.000000,13.0,6.000000,-1.999978e+00,-1.693083e+00,-1.709436e+00
25%,2018-04-24 00:00:00,24.000000,10.000000,1299.000000,2018-04-24 00:00:00,2018-04-24 10:00:00,2018.0,4.000000,8.000000,17.0,10.000000,-5.420451e-01,-7.459791e-01,-6.977698e-01
50%,2018-05-16 00:00:00,30.000000,16.000000,1499.000000,2018-05-16 00:00:00,2018-05-16 15:30:00,2018.0,5.000000,16.000000,20.0,12.000000,-1.444272e-01,-1.145765e-01,-4.448533e-01
75%,2018-06-08 00:00:00,35.000000,24.000000,2499.000000,2018-06-08 00:00:00,2018-06-08 14:30:00,2018.0,6.000000,23.000000,23.0,17.000000,1.869211e-01,7.272936e-01,8.197296e-01
max,2018-06-30 00:00:00,70.000000,64.000000,3999.000000,2018-06-30 00:00:00,2018-06-30 12:00:00,2018.0,6.000000,31.000000,26.0,20.000000,2.506359e+00,4.936644e+00,2.716604e+00
std,NaN,15.092156,9.504098,790.894827,NaN,NaN,0.0,0.815678,8.603637,3.756824,3.922240,1.000152e+00,1.000152e+00,1.000152e+00